{"sections":{"featured_text_ryhQgL":{"type":"featured-text","name":"Rich text","settings":{"title":"About Lumenarc!","content":"<p><em>At Lumenarc, we do more than provide lighting, we create thoughtfully designed environments where light enhances both function and aesthetics. As specialists in premium lighting design, high-quality product supply and full-scale project management we go beyond the role of a typical supplier. Instead, we act as dedicated project partners, ensuring that every lighting solution aligns seamlessly with both artistic vision and technical precision.<\/em><\/p><p><em>Unlike traditional wholesalers or retailers we offer a comprehensive, end-to-end approach to lighting. From initial design and product selection to regulatory compliance and delivery  we oversee every phase with careful attention to detail. Our expertise ensures that lighting is not just an add-on but a crucial element in architectural and interior design strategies.<\/em><\/p><p><em>Our portfolio includes a diverse range of projects, from luxury residential towers and high-performance fitness centers to innovative retail spaces and custom commercial environments. This breadth of experience keeps us at the cutting edge of industry trends and allows us to adapt our approach to meet the specific needs of each project.<\/em><\/p><p><em>Clients choose Lumenarc because we simplify the complexities of lighting projects. Our vertically integrated model ensures consistency, accountability and superior quality throughout every stage. By bridging the gap between creative design and practical execution we deliver lighting solutions that not only meet expectations but exceed them. Whether you’re an architect, designer, developer, or business owner, working with Lumenarc means having a committed team invested in your project’s success.<\/em><\/p><p><em>Let’s create something exceptional together. Illuminate your vision with Lumenarc.<\/em><\/p>","button_label":"","button_link":"","text_size":"featured_text","text_alignment":"center"}},"divider_RpXpdd":{"type":"divider","name":"Divider","settings":{"divider_spacing":20,"divider_border":true}},"main":{"type":"contact-template","settings":{"contact_text_position":"row","contact_text_alignment":"left"}},"newsletter_ftMJYN":{"type":"newsletter","name":"Newsletter","settings":{"title":"Sign up today","newsletter_richtext":"<p>Sign up to get the latest on sales, new releases and more …<\/p>","display_first_name":true,"display_last_name":true,"text_color":"#000000","background_color":"#ffffff","use_border":false,"nav_border":"double"}}},"order":["featured_text_ryhQgL","divider_RpXpdd","main","newsletter_ftMJYN"]}